innerldms/app/Http/Controllers/DocumentController.php

select * from `tbl_documents` where `user_id` = 'AN614270'
---
public function DocRecords(){
  $userid=session('userid');
  $docs=Document::where('user_id',$userid)->get();

select `doc_name`, `renewal_date`, `alertdays` from `tbl_documents` where `user_id` = 'NA716790'
---
public function docNotification(){

  $records=Document::where('user_id',session('userid'))->get(['doc_name','renewal_date','alertdays']);

select * from `tbl_documents` where `id` = '1' and `user_id` = 'NA716790'
---
public function EditDoc($id){
$records=Document::where('id',$id)->where('user_id',session('userid'))->get();

update `tbl_documents` set `doc_name` = 'dsfsdf', `purpose` = 'dfsdsf', `reg_date` = '2019-02-21', `renewal_date` = '2019-03-20', `count_doc_renewed` = '3', `amount` = '2000', `doc_shared_to` = 'fsdfdsf', `alertdays` = '17', `updated_at` = '2019-03-13 12:20:47' where `id` = '1' and `user_id` = 'NA716790'
---
public function updateDoc(Request $request){
       $date=$this->dateConvert($request->input('date'));
       $renewaldate=$this->dateConvert($request->input('renewaldate'));
       $id=$request->input('id');
       //$data=$request->except('_token');
      // var_dump($data);
       $data['doc_name']=$request->input('regname');
       $data['purpose']=$request->input('purpose');
       $data['reg_date']=$date;
       $data['renewal_date']=$renewaldate;
       $data['count_doc_renewed']=$request->input('number');
       $data['amount']=$request->input('amount');
       $data['doc_shared_to']=$request->input('sharedwith');
       $data['alertdays']=$request->input('alertdays');
       Document::where('id',$id)->where('user_id',session('userid'))->update($data);