innerldms/app/Http/Controllers/SignupController.php

    public function saveUser(Request $request){
       $user=new Signup;
       $name=$request->input('name');
       $n1=strtoupper($name);
       $n2=substr($n1,0,2);
       $userid=$n2.mt_rand(100000,999999);
       $user->user_id=$userid;
       $user->user_name=$name;
       $user->password=$request->input('password');
       $user->save();
---
insert into `tbl_signup` (`user_id`, `user_name`, `password`, `updated_at`, `created_at`) values ('AN614270', 'Anju', 'anju123', '2019-03-13 12:21:21', '2019-03-13 12:21:21')

    public function checkUser(Request $request){
        $users=Signup::all();
---
select * from `tbl_signup`